package codeBasic1;

public class Code1 {
    public static void main(String[] args){
        //1.& 逻辑与
        // 运算规则: 0为false, 1为true
        int a = 200 ; //0000 0000 0000 0000 0000 0000 1100 1000
        int b = 10 ;  //0000 0000 0000 0000 0000 0000 0000 1010
        //原码进行 & 逻辑且 运算,0为false,1为true
        //结果为: 0000 0000 0000 0000 0000 0000 0000 1000
        System.out.println(a & b); //8

        //2. | 逻辑或
        // 运算规则: 0为false, 1为true
        int c = 200; //0000 0000 0000 0000 0000 0000 1100 1000
        int d = 10;  //0000 0000 0000 0000 0000 0000 0000 1010
        //原码进行|逻辑或 运算
        //结果为: 0000 0000 0000 0000 0000 0000 1100 1010
        System.out.println(c | d); //202

        //3. << 左移
        //运算规则: 向左移动,低位补0
        int e = 200;//0000 0000 0000 0000 0000 0000 1100 1000
        //向左移动两格后 0000 0000 0000 0000 0000 0011 0010 0000
        System.out.println(e << 2); // 800

        //4.>> 右移
        // 运算规则: 向右移动,高位补0或1
        int f = 200; //0000 0000 0000 0000 0000 0000 1100 1000
        //0000 0000 0000 0000 0000 0000 0011 0010
        System.out.println(f >> 2); //50
    }
}
